Repository: amironov73/ManagedIrbis5
Catalog: Source/Libs/ManagedIrbis5/Properties/Resources.*.resx
Languages: ru

source: Broken network event
ru: Событие сетевого сбоя

source: Empty response
ru: Пустой ответ сервера

# SmartRead_Readed
source: , readed=
ru: , однако получено=

# SmartRead_EmptyResponse
source: : empty response
ru: : пустой ответ сервера

source: : can't read first line of the response
ru: : невозможно прочитать первую строку ответа сервера

# SmartRead_Expected
source: : expected=
ru: : ожидалось=

source: Can't resolve host
ru: Невозможно разрешить сетевой адрес

source: ConnectionCreator not set
ru: Не назначен ConnectionCreator

# FieldTag_Verify_BadTag1
source: : bad tag=
ru: : неверная метка поля=

# FieldValue_Verify_BadValue
source: : bad value=
ru: : неверное значение поля=

# IrbisEncoding_NotSingleByteEncoding
source: : not single-byte encoding
ru: : ожидается однобайтовая кодировка

# FieldValue_Verify_BadFieldValue
source: Bad Field.Value:
ru: Неверное значение поля

# FieldTag_Verify_BadTag2
source: bad tag=
ru: Неверная метка поля=

# ErrorDescription_GeneralError
source: General error
ru: Общая ошибка

# ErrorDescription_GivenMfnOutsideTheDatabaseRange
source: Given MFN is outside the database range
ru: Заданный MFN вне пределов БД

# ErrorDescription_NoError
source: No error
ru: Нет ошибки

# ErrorDescription_NormalReturn
source: Normal return
ru: Нормальное завершение

# ErrorDescription_UnknownError
source: Unknown error
ru: Неизвестная ошибка

# ErrorDescription_ActualizationError
source: Error during actualization
ru: Ошибка при актуализации

# ErrorDescription_BadPassword
source: Bad password
ru: Неверный пароль

# ErrorDescription_BadShelfNumber
source: Bad shelf number
ru: Ошибочный номер полки

# ErrorDescription_BadShelfSize
source: Bad shelf size
ru: Ошибочный размер полки

# ErrorDescription_ClientAlreadyRegistered
source: The client is already registered
ru: Клиент уже зарегистрирован

# ErrorDescription_ClientNotAllowed
source: Client not allowed
ru: Недопустимый клиент

# ErrorDescription_FieldIsAbsent
source: The field is absent
ru: Указанное поле отсутствует

# ErrorDescription_FileNotExist
source: File not exist
ru: Файл не существует

# ErrorDescription_MfnOutsideTheDatabaseRange
source: MFN outside the database range
ru: MFN вне пределов БД

# ErrorDescription_BadClientIdentifier
source: Bad client identifier
ru: Неправильный уникальный идентификатор клиента

# ErrorDescription_ClientNotInUse
source: Client doesn't in use
ru: Клиент не выполнил вход на сервер (клиент не используется)

# ErrorDescription_ClientNotRegistered
source: Client not registered
ru: Незарегистрированный клиент (ошибка входа на сервер) (клиент не в списке)

# ErrorDescription_NoPreviousVersionOfTheRecord
source: No previous version of the record
ru: Предыдущая версия записи отсутствует

# ErrorDescription_ProtocolError
source: Protocol error
ru: Ошибка в протоколе (WRONG_PROTOCOL)

# ErrorDescription_ReadError
source: Read error
ru: Ошибка чтения

# ErrorDescription_RecordIsBlocked
source: The record is blocked
ru: Запись заблокирована на ввод

# ErrorDescription_RecordIsLogicallyDeleted
source: The record is logically deleted
ru: Запись логически удалена

# ErrorDescription_RecordIsPhysicallyDeleted
source: The record is physically deleted
ru: Запись физически удалена

# ErrorDescription_WorkstationAccesDenied
source: Workstation access denied
ru: Нет доступа к командам АРМ

# ErrorDescription_WriteError
source: Write error
ru: Ошибка при записи

# ErrorDescription_DictionaryLoadingError
source: Dictionary loading error
ru: Ошибка загрузки словаря

# ErrorDescription_AutoinGblError
source: Error during autoin.gbl processing
ru: Ошибка autoin.gbl

# ErrorDescription_BackupCreationError
source: Backup creation error
ru: Ошибка создания резервной копии

# ErrorDescription_BackupRestoreError
source: Backup restore error
ru: Ошибка восстановления из резервной копии

# ErrorDescription_BadTerm
source: Bad term
ru: Ошибочный термин

# ErrorDescription_GlobalCorrectionParameterError
source: Global correction parameter error
ru: Ошибка в параметрах глобальной корректировки

# ErrorDescription_ServerExecutionError
source: Server execution error
ru: Ошибка исполнения сервера (SERVER_EXECUTE_ERROR)

# ErrorDescription_ERR_GBL_MET
source: Global correction: bad tag
ru: Ошибка в метке поля при глобальной корректировке

# ErrorDescription_ERR_GBL_REP
source: Global correction: bad rep tag
ru: Ошибка в REP-метке при глобальной корректировке

# ErrorDescription_DictionaryCreationError
source: Dictionary creation error
ru: Ошибка создания словаря

# ErrorDescription_ProcessError
source: Administrator thread error
ru: Не удалось запустить/прервать поток администратора (ошибка процесса)

# ErrorDescription_LastTerm
source: Last term in the list
ru: Последний термин в списке

# ErrorDescription_DatabaseIsLocked
source: Database is exclusively locked
ru: База данных монопольно заблокирована

# ErrorDescription_FirstTerm
source: First term in the list
ru: Первый термин в списке

# ErrorDescription_IfpError
source: Index file error
ru: Ошибка при открытии файлов IFP (ошибка файла индекса)

# ErrorDescription_MstError
source: Master file error
ru: Ошибка при открытии файлов MST или XRF (ошибка файла данных)

# ErrorDescription_RecordVersionError
source: Record version mismatch
ru: Ошибка версии записи

# ErrorDescription_ServerOverloaded
source: Server is overloaded
ru: Сервер перегружен. Достигнуто максимальное число потоков обработки

# ErrorDescription_SortingError
source: Error during sorting
ru: Ошибка сортировки

# ErrorDescription_TermNotExist
source: Term doesn't exist
ru: Заданный термин не найден (термин не существует)

# VerifyFormat_TextIsAbsent
source: Text is absent
ru: Отсутствует текст

# VerifyFormat_TextIsAbsent2
source: : text is absent
ru: : отсутствует текст

source: Database not set
ru: Не указана база данных

# IrbisProvider_NonOverriden
source: : non overriden
ru: : метод не переопределён в потомке

# ProviderManager_ProviderNameNotSpecified
source: : provider name not specified
ru: : не задано имя провайдера

# ProviderManager_ProviderNotFound
source: : provider not found:
ru: : провайдер не найден:

# ProviderManager_ProviderNotFound2
source: Provider not found:
ru: Провайдер не найден:

# ProviderManager_CanTFindType
source: : can't find type:
ru: : не найден тип:

# ProviderManager_CantFindType2
source: Can't find type:
ru: Не найден тип:

# ProviderManager_IrbisProviderConfigurationKeyNotSpecified
source: IrbisProvider configuration key not specified
ru: Не задан элемент конфигурации IrbisProvider

# ServerResponse_BadFormat
source: : bad format=
ru: : плохой формат=

# AbstractEngine_NotConnected
source: Not connected
ru: Не установлено подключение к серверу

# AbstractEngine_NotConnected2
source: : not connected
ru: : не установлено подключение к серверу

# AbstractEngine_StandardExecution_Failed
source: failed
ru: сбой

# BatchAccessor_SomeRecordsNotRetrieved
source: some records not retrieved
ru: некоторые записи не были получены

# BatchAccessor_EmptyRecordDetected
source: : empty record detected
ru: : обнаружена пустая запись

# IrbisConnection_CantSetSocketWhileConnected
source: Can't set socket while connected
ru: Нельзя менять сокет, пока установлено подключение к серверу

# IrbisConnection_DecryptedStateIsNull
source: Decrypted state is null
ru: Расшифрованное состояние подключения пустое

# IrbisConnection_NoRecordRetrieved
source: no record retrieved
ru: ни одной записи не получено

# IrbisConnection_ResultRecordIsNull
source: result record is null
ru: результирующая запись пуста

source: Already connected
ru: Уже установлено подключение к серверу

source: username not specified
ru: не задано имя пользователя

source: password not specified
ru: не задан пароль

# WriteRecordsCommand_DatabaseNotSet
source: database not set
ru: Не задана база данных

# IrbisNetworkUtility_DatabaseNotSpecified
source: database not specified
ru: не задана база данных

# IrbisNetworkUtility_EmptyRecordDetected
source: empty record detected
ru: обнаружена пустая запись

# IrbisNetworkUtility_RecordIsNull
source: record is null
ru: запись отсутствует

# WriteRecordsCommand_NoRecordsGiven
source: no records given
ru: записи не заданы

# WriteRecordsCommand_TooManyRecords
source: too many records
ru: слишком много записей

source: Record too long
ru: Запись слишком длинная
